In [1]:
import pandas as pd

In [2]:
folks = {
    'first': ['Tanvir', 'Reaz', 'Estiak'],
    'last': ['Raihan', 'Nahid', 'Ahmed'],
    'designation': ['Software Engineer', 'Software Engineer', 'Software Developer'],
    'email': ['tanvir@gmail.com', 'nahid@gmail.com', 'estiak@gmail.com']
}

In [3]:
df = pd.DataFrame(folks)

In [4]:
df

    first    last         designation             email
0  Tanvir  Raihan   Software Engineer  tanvir@gmail.com
1    Reaz   Nahid   Software Engineer   nahid@gmail.com
2  Estiak   Ahmed  Software Developer  estiak@gmail.com

In [5]:
#Check the default shape

In [7]:
df.shape

(3, 4)

In [11]:
# Get the `email` column or a series i.e a rows of single column

In [9]:
df['email']

0    tanvir@gmail.com
1     nahid@gmail.com
2    estiak@gmail.com
Name: email, dtype: object

In [10]:
type(df['email'])

pandas.core.series.Series

In [12]:
# get 2 column out of three

In [13]:
df[['first', 'email']]

    first             email
0  Tanvir  tanvir@gmail.com
1    Reaz   nahid@gmail.com
2  Estiak  estiak@gmail.com

In [14]:
# get columns

In [15]:
df.columns

Index(['first', 'last', 'designation', 'email'], dtype='object')

In [20]:
# use iloc(integer location) to get rows

In [17]:
df.iloc[0] # will return a first row

first                     Tanvir
last                      Raihan
designation    Software Engineer
email           tanvir@gmail.com
Name: 0, dtype: object

In [18]:
# return multiple rows

In [19]:
df.iloc[[0, 1]]

    first    last        designation             email
0  Tanvir  Raihan  Software Engineer  tanvir@gmail.com
1    Reaz   Nahid  Software Engineer   nahid@gmail.com

In [21]:
# return a single columns of this rows

In [22]:
df.iloc[[0, 1], 2]

0    Software Engineer
1    Software Engineer
Name: designation, dtype: object

In [23]:
# return multiple columns of selected rows

In [24]:
df.iloc[[0, 2], [1,3]]

     last             email
0  Raihan  tanvir@gmail.com
2   Ahmed  estiak@gmail.com

In [25]:
# get rows using loc(label location or integer location)

In [27]:
df.loc[0]

first                     Tanvir
last                      Raihan
designation    Software Engineer
email           tanvir@gmail.com
Name: 0, dtype: object

In [28]:
# get multiple rows using loc

In [30]:
df.loc[[0, 2]]

    first    last         designation             email
0  Tanvir  Raihan   Software Engineer  tanvir@gmail.com
2  Estiak   Ahmed  Software Developer  estiak@gmail.com

In [31]:
# select a column of the selected rows

In [32]:
df.loc[[0,2], 'last']

0    Raihan
2     Ahmed
Name: last, dtype: object

In [33]:
# select multiple column of the selected rows

In [34]:
df.loc[[0,2], ['first', 'last']]

    first    last
0  Tanvir  Raihan
2  Estiak   Ahmed